:- module(кубок_из_черепа_личности, [
	историческая_личность/2,
	дата_рождения/4,
	дата_смерти/4,
	пол/2,
	жена/2,
	ссылка_на_википедию/2
]).

дата_рождения("03947547-c281-437e-bb2f-3c74ba66c5f1", 1469, 5, 3).
дата_рождения("09763204-5162-4ea3-a7f5-97bf3d392c38", null, null, null).
дата_рождения("0bb29887-3e7e-4da1-8e7f-91d087811dc6", 720, null, null).
дата_рождения("109402cd-6e4b-4c2c-af08-29057e1a1a26", null, null, null).
дата_рождения("32fc8ac4-3b97-4332-a865-4854e01166fa", null, null, null).
дата_рождения("5ab6fd2a-84b6-4e0b-94bc-cd044ec23f97", 1672, 10, 21).
дата_рождения("67073092-fd74-4d59-b609-951acc7a12f8", 920, null, null).
дата_рождения("67073092-fd74-4d59-b609-951acc7a12f8", 942, null, null).
дата_рождения("803591e2-d614-4997-a855-45b7dc610062", 1056, null, null).
дата_рождения("bcf6b748-2712-4a5b-be47-88f2668d3cad", 950, null, null).
дата_рождения("c1c2e2e8-0274-4c21-99f3-93d3c20c49b0", null, null, null).
дата_рождения("c67e3556-d018-48d5-800d-578d3a859fbf", 526, null, null).
дата_рождения("db416d49-1e8c-4e09-8cce-9b3904f73990", 1926, 4, 20).
дата_рождения("e7ac158a-8ae4-4228-8dc3-d831a12684da", 540, null, null).
дата_смерти("03947547-c281-437e-bb2f-3c74ba66c5f1", 1527, 6, 21).
дата_смерти("09763204-5162-4ea3-a7f5-97bf3d392c38", null, null, null).
дата_смерти("0bb29887-3e7e-4da1-8e7f-91d087811dc6", 799, null, null).
дата_смерти("109402cd-6e4b-4c2c-af08-29057e1a1a26", null, null, null).
дата_смерти("32fc8ac4-3b97-4332-a865-4854e01166fa", 567, null, null).
дата_смерти("5ab6fd2a-84b6-4e0b-94bc-cd044ec23f97", 1750, 1, 23).
дата_смерти("67073092-fd74-4d59-b609-951acc7a12f8", 972, null, null).
дата_смерти("803591e2-d614-4997-a855-45b7dc610062", 1114, null, null).
дата_смерти("bcf6b748-2712-4a5b-be47-88f2668d3cad", 992, null, null).
дата_смерти("c1c2e2e8-0274-4c21-99f3-93d3c20c49b0", null, null, null).
дата_смерти("c67e3556-d018-48d5-800d-578d3a859fbf", 572, null, null).
дата_смерти("c67e3556-d018-48d5-800d-578d3a859fbf", 573, null, null).
дата_смерти("db416d49-1e8c-4e09-8cce-9b3904f73990", 2008, 11, 20).
дата_смерти("e7ac158a-8ae4-4228-8dc3-d831a12684da", 572, null, null).
жена("e7ac158a-8ae4-4228-8dc3-d831a12684da", "c67e3556-d018-48d5-800d-578d3a859fbf"). % жена Альбоина Роземунда
жена("5a7f39b8-3bbb-4e85-bf1d-5168ca767210", "09763204-5162-4ea3-a7f5-97bf3d392c38").
историческая_личность("неизвестная", "5a7f39b8-3bbb-4e85-bf1d-5168ca767210"). % жена Кури, о ней ничего не известно
историческая_личность("Альбоин", "c67e3556-d018-48d5-800d-578d3a859fbf").
историческая_личность("Гунимунд", "109402cd-6e4b-4c2c-af08-29057e1a1a26").
историческая_личность("Гунимунд", "32fc8ac4-3b97-4332-a865-4854e01166fa").
историческая_личность("Кунимунд", "32fc8ac4-3b97-4332-a865-4854e01166fa").
историческая_личность("Куря", "09763204-5162-4ea3-a7f5-97bf3d392c38"). % печенежский хан
историческая_личность("Куря", "c1c2e2e8-0274-4c21-99f3-93d3c20c49b0"). % половецкий хан
историческая_личность("Лев Диакон", "bcf6b748-2712-4a5b-be47-88f2668d3cad").
историческая_личность("Лудовико Антонио Муратори", "5ab6fd2a-84b6-4e0b-94bc-cd044ec23f97").
историческая_личность("Нестор", "803591e2-d614-4997-a855-45b7dc610062"). % Нестор Летописец, Нестор Печорский
историческая_личность("Никколо Макиавелли", "03947547-c281-437e-bb2f-3c74ba66c5f1").
историческая_личность("Павел Диакон", "0bb29887-3e7e-4da1-8e7f-91d087811dc6").
историческая_личность("Розамунда", "e7ac158a-8ae4-4228-8dc3-d831a12684da"). % королева лангобардов
историческая_личность("Светлана Плетнёва", "db416d49-1e8c-4e09-8cce-9b3904f73990"). % Плетнёва, Светлана Александровна
историческая_личность("Святослав", "67073092-fd74-4d59-b609-951acc7a12f8").
историческая_личность("Святослав Игоревич", "67073092-fd74-4d59-b609-951acc7a12f8").
пол("03947547-c281-437e-bb2f-3c74ba66c5f1", 1).
пол("09763204-5162-4ea3-a7f5-97bf3d392c38", 1).
пол("0bb29887-3e7e-4da1-8e7f-91d087811dc6", 1).
пол("109402cd-6e4b-4c2c-af08-29057e1a1a26", 1).
пол("32fc8ac4-3b97-4332-a865-4854e01166fa", 1).
пол("5ab6fd2a-84b6-4e0b-94bc-cd044ec23f97", 1).
пол("67073092-fd74-4d59-b609-951acc7a12f8", 1).
пол("803591e2-d614-4997-a855-45b7dc610062", 1).
пол("bcf6b748-2712-4a5b-be47-88f2668d3cad", 1).
пол("c1c2e2e8-0274-4c21-99f3-93d3c20c49b0", 1).
пол("c67e3556-d018-48d5-800d-578d3a859fbf", 1).
пол("db416d49-1e8c-4e09-8cce-9b3904f73990", 0).
пол("e7ac158a-8ae4-4228-8dc3-d831a12684da", 0).
ссылка_на_википедию("03947547-c281-437e-bb2f-3c74ba66c5f1", "https://ru.wikipedia.org/wiki/%D0%9C%D0%B0%D0%BA%D0%B8%D0%B0%D0%B2%D0%B5%D0%BB%D0%BB%D0%B8,_%D0%9D%D0%B8%D0%BA%D0%BA%D0%BE%D0%BB%D0%BE").
ссылка_на_википедию("09763204-5162-4ea3-a7f5-97bf3d392c38", "https://ru.wikipedia.org/wiki/%D0%9A%D1%83%D1%80%D1%8F_(%D0%BF%D0%B5%D1%87%D0%B5%D0%BD%D0%B5%D0%B6%D1%81%D0%BA%D0%B8%D0%B9_%D1%85%D0%B0%D0%BD)").
ссылка_на_википедию("0bb29887-3e7e-4da1-8e7f-91d087811dc6", "https://ru.wikipedia.org/wiki/%D0%9F%D0%B0%D0%B2%D0%B5%D0%BB_%D0%94%D0%B8%D0%B0%D0%BA%D0%BE%D0%BD").
ссылка_на_википедию("109402cd-6e4b-4c2c-af08-29057e1a1a26", "https://ru.wikipedia.org/wiki/%D0%93%D1%83%D0%BD%D0%B8%D0%BC%D1%83%D0%BD%D0%B4").
ссылка_на_википедию("32fc8ac4-3b97-4332-a865-4854e01166fa", "https://ru.wikipedia.org/wiki/%D0%9A%D1%83%D0%BD%D0%B8%D0%BC%D1%83%D0%BD%D0%B4").
ссылка_на_википедию("5ab6fd2a-84b6-4e0b-94bc-cd044ec23f97", "https://ru.wikipedia.org/wiki/%D0%9C%D1%83%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%B8,_%D0%9B%D1%83%D0%B4%D0%BE%D0%B2%D0%B8%D0%BA%D0%BE_%D0%90%D0%BD%D1%82%D0%BE%D0%BD%D0%B8%D0%BE").
ссылка_на_википедию("67073092-fd74-4d59-b609-951acc7a12f8", "https://ru.wikipedia.org/wiki/%D0%A1%D0%B2%D1%8F%D1%82%D0%BE%D1%81%D0%BB%D0%B0%D0%B2_%D0%98%D0%B3%D0%BE%D1%80%D0%B5%D0%B2%D0%B8%D1%87").
ссылка_на_википедию("803591e2-d614-4997-a855-45b7dc610062", "https://ru.wikipedia.org/wiki/%D0%9D%D0%B5%D1%81%D1%82%D0%BE%D1%80_%D0%9B%D0%B5%D1%82%D0%BE%D0%BF%D0%B8%D1%81%D0%B5%D1%86").
ссылка_на_википедию("bcf6b748-2712-4a5b-be47-88f2668d3cad", "https://ru.wikipedia.org/wiki/%D0%9B%D0%B5%D0%B2_%D0%94%D0%B8%D0%B0%D0%BA%D0%BE%D0%BD").
ссылка_на_википедию("c1c2e2e8-0274-4c21-99f3-93d3c20c49b0", "https://ru.wikipedia.org/wiki/%D0%9A%D1%83%D1%80%D1%8F_(%D0%BF%D0%BE%D0%BB%D0%BE%D0%B2%D0%B5%D1%86%D0%BA%D0%B8%D0%B9_%D1%85%D0%B0%D0%BD)").
ссылка_на_википедию("c67e3556-d018-48d5-800d-578d3a859fbf", "https://ru.wikipedia.org/wiki/%D0%90%D0%BB%D1%8C%D0%B1%D0%BE%D0%B8%D0%BD").
ссылка_на_википедию("db416d49-1e8c-4e09-8cce-9b3904f73990", "https://ru.wikipedia.org/wiki/%D0%9F%D0%BB%D0%B5%D1%82%D0%BD%D1%91%D0%B2%D0%B0,_%D0%A1%D0%B2%D0%B5%D1%82%D0%BB%D0%B0%D0%BD%D0%B0_%D0%90%D0%BB%D0%B5%D0%BA%D1%81%D0%B0%D0%BD%D0%B4%D1%80%D0%BE%D0%B2%D0%BD%D0%B0").
ссылка_на_википедию("e7ac158a-8ae4-4228-8dc3-d831a12684da", "https://ru.wikipedia.org/wiki/%D0%A0%D0%BE%D0%B7%D0%B0%D0%BC%D1%83%D0%BD%D0%B4%D0%B0_(%D0%BA%D0%BE%D1%80%D0%BE%D0%BB%D0%B5%D0%B2%D0%B0_%D0%BB%D0%B0%D0%BD%D0%B3%D0%BE%D0%B1%D0%B0%D1%80%D0%B4%D0%BE%D0%B2)").
